; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent person dron carrier num - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        (at-carrier ?c - carrier ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        ;; El dron ahora tiene un único brazo implícito
        (free ?d - dron)
        (carrying ?d - dron ?b - box)
        
        ;; Predicados para el transportador y los números
        (in-carrier ?b - box ?c - carrier)
        (boxes-in-carrier ?c - carrier ?n - num)
        (siguiente ?n1 - num ?n2 - num)
    )

    ;; Mueve solo al dron (debe tener el brazo libre)
    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (and (at-dron ?dron ?from) (free ?dron))
        :effect (and (at-dron ?dron ?to) (not (at-dron ?dron ?from)))
    )

    ;; Mueve al dron llevándose el transportador consigo (debe tener el brazo libre)
    (:action move-carrier
        :parameters (?from - location ?to - location ?dron - dron ?carrier - carrier)
        :precondition (and (at-dron ?dron ?from) (at-carrier ?carrier ?from) (free ?dron))
        :effect (and (at-dron ?dron ?to) (not (at-dron ?dron ?from)) 
                     (at-carrier ?carrier ?to) (not (at-carrier ?carrier ?from)))
    )

    ;; Recoge una caja del suelo (requiere tener el brazo libre)
    (:action pick
        :parameters (?box - box ?location - location ?dron - dron)
        :precondition (and (at-dron ?dron ?location) (at-box ?box ?location) (free ?dron))
        :effect (and (not (at-box ?box ?location)) (not (free ?dron)) (carrying ?dron ?box))
    )

    ;; Entrega una caja a una persona (el dron debe llevarla en el brazo)
    (:action leave
        :parameters (?box - box ?location - location ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location) (carrying ?dron ?box) (at-person ?person ?location) (box-has ?box ?content))
        :effect (and (at-box ?box ?location) (free ?dron) (not (carrying ?dron ?box)) 
                     (person-has ?person ?content) (not (box-has ?box ?content)))
    )

    ;; Mete una caja en el transportador (Suma 1)
    (:action put-in-carrier
        :parameters (?box - box ?location - location ?dron - dron ?carrier - carrier ?n1 - num ?n2 - num)
        :precondition (and (at-dron ?dron ?location) (at-carrier ?carrier ?location) (carrying ?dron ?box) 
                           (boxes-in-carrier ?carrier ?n1) (siguiente ?n1 ?n2))
        :effect (and (not (carrying ?dron ?box)) (free ?dron) (in-carrier ?box ?carrier) 
                     (not (boxes-in-carrier ?carrier ?n1)) (boxes-in-carrier ?carrier ?n2))
    )

    ;; Saca una caja del transportador (Resta 1)
    (:action take-from-carrier
        :parameters (?box - box ?location - location ?dron - dron ?carrier - carrier ?n1 - num ?n2 - num)
        :precondition (and (at-dron ?dron ?location) (at-carrier ?carrier ?location) (free ?dron) (in-carrier ?box ?carrier) 
                           (boxes-in-carrier ?carrier ?n2) (siguiente ?n1 ?n2))
        :effect (and (carrying ?dron ?box) (not (free ?dron)) (not (in-carrier ?box ?carrier)) 
                     (not (boxes-in-carrier ?carrier ?n2)) (boxes-in-carrier ?carrier ?n1))
    )
)

; problem
(define (problem drone_problem_d1_carr1_l3_p3_c4_g3)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 - location
	box1 box2 box3 box4 - box
	comida medicina - bcontent
	person1 person2 person3 - person
	carrier1 - carrier
	n0 n1 n2 n3 n4 - num
)

(:init
	(siguiente n0 n1)
	(siguiente n1 n2)
	(siguiente n2 n3)
	(siguiente n3 n4)
	(at-dron dron1 deposito)
	(free dron1)
	(at-carrier carrier1 deposito)
	(boxes-in-carrier carrier1 n0)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 medicina)
	(at-box box3 deposito)
	(box-has box3 medicina)
	(at-box box4 deposito)
	(box-has box4 medicina)
	(at-person person1 refugio2)
	(at-person person2 refugio2)
	(at-person person3 refugio3)
)

(:goal (and
	(person-has person1 medicina)
	(person-has person2 medicina)
	(person-has person3 comida)
))
)

; plan
1. (pick box4 deposito dron1)
   deleted: (at-box box4 deposito) (free dron1)
   added: (carrying dron1 box4)
   goals met: 0 of 3
2. (put-in-carrier box4 deposito dron1 carrier1 n0 n1)
   deleted: (carrying dron1 box4) (boxes-in-carrier carrier1 n0)
   added: (free dron1) (in-carrier box4 carrier1) (boxes-in-carrier carrier1 n1)
   goals met: 0 of 3
3. (pick box1 deposito dron1)
   deleted: (at-box box1 deposito) (free dron1)
   added: (carrying dron1 box1)
   goals met: 0 of 3
4. (put-in-carrier box1 deposito dron1 carrier1 n1 n2)
   deleted: (carrying dron1 box1) (boxes-in-carrier carrier1 n1)
   added: (free dron1) (in-carrier box1 carrier1) (boxes-in-carrier carrier1 n2)
   goals met: 0 of 3
5. (move-carrier deposito refugio2 dron1 carrier1)
   deleted: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   added: (at-dron dron1 refugio2) (at-carrier carrier1 refugio2)
   goals met: 0 of 3
6. (move-carrier refugio2 refugio3 dron1 carrier1)
   deleted: (at-dron dron1 refugio2) (at-carrier carrier1 refugio2)
   added: (at-dron dron1 refugio3) (at-carrier carrier1 refugio3)
   goals met: 0 of 3
7. (take-from-carrier box1 refugio3 dron1 carrier1 n1 n2)
   deleted: (free dron1) (in-carrier box1 carrier1) (boxes-in-carrier carrier1 n2)
   added: (carrying dron1 box1) (boxes-in-carrier carrier1 n1)
   goals met: 0 of 3
8. (leave box1 refugio3 dron1 person3 comida)
   deleted: (carrying dron1 box1) (box-has box1 comida)
   added: (at-box box1 refugio3) (free dron1) (person-has person3 comida)
   goals met: 1 of 3
9. (move-carrier refugio3 refugio2 dron1 carrier1)
   deleted: (at-dron dron1 refugio3) (at-carrier carrier1 refugio3)
   added: (at-dron dron1 refugio2) (at-carrier carrier1 refugio2)
   goals met: 1 of 3
10. (take-from-carrier box4 refugio2 dron1 carrier1 n0 n1)
   deleted: (free dron1) (in-carrier box4 carrier1) (boxes-in-carrier carrier1 n1)
   added: (carrying dron1 box4) (boxes-in-carrier carrier1 n0)
   goals met: 1 of 3
11. (leave box4 refugio2 dron1 person1 medicina)
   deleted: (carrying dron1 box4) (box-has box4 medicina)
   added: (at-box box4 refugio2) (free dron1) (person-has person1 medicina)
   goals met: 2 of 3
12. (move-carrier refugio2 deposito dron1 carrier1)
   deleted: (at-dron dron1 refugio2) (at-carrier carrier1 refugio2)
   added: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   goals met: 2 of 3
13. (pick box3 deposito dron1)
   deleted: (at-box box3 deposito) (free dron1)
   added: (carrying dron1 box3)
   goals met: 2 of 3
14. (put-in-carrier box3 deposito dron1 carrier1 n0 n1)
   deleted: (carrying dron1 box3) (boxes-in-carrier carrier1 n0)
   added: (free dron1) (in-carrier box3 carrier1) (boxes-in-carrier carrier1 n1)
   goals met: 2 of 3
15. (move-carrier deposito refugio2 dron1 carrier1)
   deleted: (at-dron dron1 deposito) (at-carrier carrier1 deposito)
   added: (at-dron dron1 refugio2) (at-carrier carrier1 refugio2)
   goals met: 2 of 3
16. (take-from-carrier box3 refugio2 dron1 carrier1 n0 n1)
   deleted: (free dron1) (in-carrier box3 carrier1) (boxes-in-carrier carrier1 n1)
   added: (carrying dron1 box3) (boxes-in-carrier carrier1 n0)
   goals met: 2 of 3
17. (leave box3 refugio2 dron1 person2 medicina)
   deleted: (carrying dron1 box3) (box-has box3 medicina)
   added: (at-box box3 refugio2) (free dron1) (person-has person2 medicina)
   goals met: 3 of 3
